larazillow11/app/Http/Controllers/ListingController.php

select * from `listings`
---
    public function index()
    {
        return inertia(
            'Listing/Index',
            [
                'listings' => Listing::all()
            ]
        );

insert into `listings` (`beds`, `baths`, `area`, `city`, `street`, `code`, `street_nr`, `price`, `updated_at`, `created_at`) values (0, 0, 0, 'ssss', 'ss', 'ss', 'ssss', 0, '2025-05-23 14:40:06', '2025-05-23 14:40:06')
---
    public function store(Request $request)
    {
        $validated = $request->validate([
            'beds' => 'required|integer|min:1|max:20',
            'baths' => 'required|integer|min:1',
            'area' => 'required|integer|min:1',
            'city' => 'required|string|max:255',
            'street' => 'required|string|max:255',
            'code' => 'required|string|max:255',
            'street_nr' => 'required|integer|min:1',
            'price' => 'required|integer|min:1',
        ]);

        Listing::create($validated);